wellmanaz/DxCore/megaavr/boards.txt
#----------------------------------------#
# Clock speed and source options         #
#________________________________________#
avrda.menu.clock.24internal=24 MHz internal
avrda.menu.clock.24internal.build.speed=24
avrda.menu.clock.24internal.build.clocksource=0
avrda.menu.clock.20internal=20 MHz internal
avrda.menu.clock.20internal.build.speed=20
avrda.menu.clock.20internal.build.clocksource=0
avrda.menu.clock.16internal=16 MHz internal
avrda.menu.clock.16internal.build.speed=16
avrda.menu.clock.16internal.build.clocksource=0
avrda.menu.clock.12internal=12 MHz internal
avrda.menu.clock.12internal.build.speed=12
avrda.menu.clock.12internal.build.clocksource=0
avrda.menu.clock.10internal=10 MHz internal
avrda.menu.clock.10internal.build.speed=10
avrda.menu.clock.10internal.build.clocksource=0
avrda.menu.clock.8internal=8 MHz internal
avrda.menu.clock.8internal.build.speed=8
avrda.menu.clock.8internal.build.clocksource=0
avrda.menu.clock.5internal=5 MHz internal
avrda.menu.clock.5internal.build.speed=5
avrda.menu.clock.5internal.build.clocksource=0
avrda.menu.clock.4internal=4 MHz internal
avrda.menu.clock.4internal.build.speed=4
avrda.menu.clock.4internal.build.clocksource=0
avrda.menu.clock.1internal=1 MHz internal
avrda.menu.clock.1internal.build.speed=1
avrda.menu.clock.1internal.build.clocksource=0
avrda.menu.clock.24extclock=24 MHz ext. clock
avrda.menu.clock.24extclock.build.speed=24
avrda.menu.clock.24extclock.build.clocksource=2
avrda.menu.clock.20extclock=20 MHz ext. clock
avrda.menu.clock.20extclock.build.speed=20
avrda.menu.clock.20extclock.build.clocksource=2
avrda.menu.clock.16extclock=16 MHz ext. clock
avrda.menu.clock.16extclock.build.speed=16
avrda.menu.clock.16extclock.build.clocksource=2
avrda.menu.clock.12extclock=12 MHz ext. clock
avrda.menu.clock.12extclock.build.speed=12
avrda.menu.clock.12extclock.build.clocksource=2
avrda.menu.clock.8extclock=8 MHz ext. clock
avrda.menu.clock.8extclock.build.speed=8
avrda.menu.clock.8extclock.build.clocksource=2
avrda.menu.clock.28internal=28 MHz internal (overclocked)
avrda.menu.clock.28internal.build.speed=28
avrda.menu.clock.28internal.build.clocksource=0
avrda.menu.clock.32internal=32 MHz internal (overclocked)
avrda.menu.clock.32internal.build.speed=32
avrda.menu.clock.32internal.build.clocksource=0
avrda.menu.clock.25extclock=25 MHz ext. clock (slightly overclocked)
avrda.menu.clock.25extclock.build.speed=25
avrda.menu.clock.25extclock.build.clocksource=2
avrda.menu.clock.27extclock=27 MHz ext. clock (overclocked)
avrda.menu.clock.27extclock.build.speed=27
avrda.menu.clock.27extclock.build.clocksource=2
avrda.menu.clock.28extclock=28 MHz ext. clock (overclocked)
avrda.menu.clock.28extclock.build.speed=28
avrda.menu.clock.28extclock.build.clocksource=2
avrda.menu.clock.30extclock=30 MHz ext. clock (overclocked)
avrda.menu.clock.30extclock.build.speed=30
avrda.menu.clock.30extclock.build.clocksource=2
avrda.menu.clock.32extclock=32 MHz ext. clock (overclocked)
avrda.menu.clock.32extclock.build.speed=32
avrda.menu.clock.32extclock.build.clocksource=2
avrda.menu.clock.36extclock=36 MHz ext. clock (highly overclocked)
avrda.menu.clock.36extclock.build.speed=36
avrda.menu.clock.36extclock.build.clocksource=2
avrda.menu.clock.40extclock=40 MHz ext. clock (highly overclocked)
avrda.menu.clock.40extclock.build.speed=40
avrda.menu.clock.40extclock.build.clocksource=2
avrda.menu.clock.48extclock=48 MHz ext. clock (WAY overclocked)
avrda.menu.clock.48extclock.build.speed=48
avrda.menu.clock.48extclock.build.clocksource=2

#----------------------------------------#
# BrownOut detection (BOD) options       #
#________________________________________#
avrda.menu.bodvoltage.1v9=1.9V
avrda.menu.bodvoltage.1v9.bootloader.bodlevbits=000
avrda.menu.bodvoltage.2v45=2.45V
avrda.menu.bodvoltage.2v45.bootloader.bodlevbits=001
avrda.menu.bodvoltage.2v70=2.70V
avrda.menu.bodvoltage.2v70.bootloader.bodlevbits=010
avrda.menu.bodvoltage.2v85=2.85V
avrda.menu.bodvoltage.2v85.bootloader.bodlevbits=011
avrda.menu.bodmode.disabled=Disabled/Disabled
avrda.menu.bodmode.enabled=Enabled/Enabled
avrda.menu.bodmode.ensampfast=Enabled/Sampled (128 Hz)
avrda.menu.bodmode.ensampslow=Enabled/Sampled (32 Hz)
avrda.menu.bodmode.sampledfast=Sampled/Sampled (128 Hz)
avrda.menu.bodmode.sampledslow=Sampled/Sampled (32 Hz)
avrda.menu.bodmode.sampdisfast=Sampled/Disabled (128 Hz)
avrda.menu.bodmode.sampdisslow=Sampled/Disabled (32 Hz)
avrda.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
avrda.menu.bodmode.disabled.bootloader.BODCFG=0x00
avrda.menu.bodmode.enabled.bootloader.bodmodebits=00101
avrda.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
avrda.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
avrda.menu.bodmode.samplefast.bootloader.bodmodebits=01010
avrda.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
avrda.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
avrda.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
avrda.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

#----------------------------------------#
# Retain EEPROM (EESAVE)                 #
#________________________________________#
avrda.menu.eesave.enable=EEPROM retained
avrda.menu.eesave.enable.bootloader.eesavebit=1
avrda.menu.eesave.disable=EEPROM not retained
avrda.menu.eesave.disable.bootloader.eesavebit=0

#----------------------------------------#
# Reset pin as input option              #
#________________________________________#
avrda.menu.resetpin.reset=Hardware Reset (recommended)
avrda.menu.resetpin.reset.bootloader.resetpinbits=10
avrda.menu.resetpin.input=Input (no output, ever)
avrda.menu.resetpin.input.bootloader.resetpinbits=00

#----------------------------------------#
# millis/micros timing source            #
#________________________________________#
avrda.menu.millis.tcb2=TCB2 (recommended)
avrda.menu.millis.disabled=Disabled
avrda.menu.millis.tcb0=TCB0
avrda.menu.millis.tcb1=TCB1
avrda.menu.millis.tcb3=TCB3 (48/64-pin parts only)
avrda.menu.millis.tcb4=TCB4 (64-pin parts only)
avrda.menu.millis.tca0=TCA0
avrda.menu.millis.tca1=TCA1 (48/64-pin parts only)
avrda.menu.millis.tcb0.build.millistimer=B0
avrda.menu.millis.tcb1.build.millistimer=B1
avrda.menu.millis.tcb2.build.millistimer=B2
avrda.menu.millis.tcb3.build.millistimer=B3
avrda.menu.millis.tcb4.build.millistimer=B4
avrda.menu.millis.tca0.build.millistimer=A0
avrda.menu.millis.tca1.build.millistimer=A1
avrda.menu.millis.disabled.build.millistimer=NONE

