wellmanaz/DxCore/megaavr/boards.txt
#----------------------------------------#
# WDT MODE                               #
#________________________________________#
avrda.menu.WDTtimeout.disabled=Disabled (recommended)
avrda.menu.WDTtimeout.8seconds=Window remains open for 8 Seconds
avrda.menu.WDTtimeout.4seconds=Window remains open for 4 Seconds
avrda.menu.WDTtimeout.2seconds=Window remains open for 2 Seconds
avrda.menu.WDTtimeout.1second=Window remains open for 1 Second
avrda.menu.WDTtimeout.500msec=Window remains open for 500 milliseconds
avrda.menu.WDTtimeout.250msec=Window remains open for 250 milliseconds
avrda.menu.WDTtimeout.125msec=Window remains open for 125 milliseconds
avrda.menu.WDTtimeout.63msec=Window remains open for 62.5 milliseconds
avrda.menu.WDTwindow.disabled=No delay before window "opens"
avrda.menu.WDTwindow.8seconds=8 Second before window "opens"
avrda.menu.WDTwindow.4seconds=4 Second before window "opens"
avrda.menu.WDTwindow.2seconds=2 Second before window "opens"
avrda.menu.WDTwindow.1second=1 Second before window "opens"
avrda.menu.WDTwindow.500msec=500 millisecond before window "opens"
avrda.menu.WDTwindow.250msec=250 millisecond before window "opens"
avrda.menu.WDTwindow.125msec=125 millisecond before window "opens"
avrda.menu.WDTwindow.63msec=62.5 millisecond before window "opens"
avrda.menu.WDTtimeout.disabled.bootloader.wdttimeoutbits=0000
avrda.menu.WDTtimeout.8seconds.bootloader.wdttimeoutbits=1011
avrda.menu.WDTtimeout.4seconds.bootloader.wdttimeoutbits=1010
avrda.menu.WDTtimeout.2seconds.bootloader.wdttimeoutbits=1001
avrda.menu.WDTtimeout.1second.bootloader.wdttimeoutbits=1000
avrda.menu.WDTtimeout.500msec.bootloader.wdttimeoutbits=0111
avrda.menu.WDTtimeout.250msec.bootloader.wdttimeoutbits=0110
avrda.menu.WDTtimeout.125msec.bootloader.wdttimeoutbits=0101
avrda.menu.WDTtimeout.63msec.bootloader.wdttimeoutbits=0100
avrda.menu.WDTwindow.disabled.bootloader.wdtwindowbits=0000
avrda.menu.WDTwindow.8seconds.bootloader.wdtwindowbits=1011
avrda.menu.WDTwindow.4seconds.bootloader.wdtwindowbits=1010
avrda.menu.WDTwindow.2seconds.bootloader.wdtwindowbits=1001
avrda.menu.WDTwindow.1second.bootloader.wdtwindowbits=1000
avrda.menu.WDTwindow.500msec.bootloader.wdtwindowbits=0111
avrda.menu.WDTwindow.250msec.bootloader.wdtwindowbits=0110
avrda.menu.WDTwindow.125msec.bootloader.wdtwindowbits=0101
avrda.menu.WDTwindow.63msec.bootloader.wdtwindowbits=0100

######################################################################################################
#                                                                                                     #
###                 ###  #     # ####      ####   ###        #     #   ###   #      #   ####          ###
#####              #   # #     # #   #     #   # #   #       # #   #  #   #  # #    #  #    #         #####
#######            #####  #   #  ####  ### #   # #####  ***  #  #  #  #####  #  #   #  #    #         #######
#####              #   #   # #   # #       #   # #   #       #   # #  #   #  #    # #  #    #         #####
###                #   #    #    #  #      ####  #   #       #     #  #   #  #      #   ####          ###
#_____________________________________________________________________________________________________#
#                                                     #
# Parameters and defaults for AVR DA Curiosity Nano   #
#_____________________________________________________#
avrdanano.upload.tool=avrdude
avrdanano.upload.prog_interlock=
avrdanano.build.board=avrdanano
avrdanano.build.core=dxcore
avrdanano.upload.maximum_size=0
avrdanano.upload.maximum_data_size=0
# The maximum size and data size attributes are overridden by the selected chip. If you are avoiding specifying that somehow, there is no hope of anything working, so don't do that.
# Each top-level entry supports at least a dozen parts with varying memory constraints.
avrdanano.build.f_cpu={build.speed}000000L
avrdanano.build.text_section_start=.text=0x0
avrdanano.build.extra_flags= {bootloader.appspm}
avrdanano.build.export_merged_output=false
avrdanano.build.printf=
avrdanano.build.flmapopts=
avrdanano.build.attachmode=-DCORE_ATTACH_ALL

#----------------------------------------#
# Bootloading parameters and fuses       #
#________________________________________#
avrdanano.bootloader.tool=avrdude
avrdanano.bootloader.WDTCFG=0b{bootloader.wdtwindowbits}{bootloader.wdttimeoutbits}
avrdanano.bootloader.wdtwindowbits=0000
avrdanano.bootloader.wdttimeotbits=0000
avrdanano.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
avrdanano.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}
avrdanano.bootloader.CODESIZE=0x00
avrdanano.bootloader.BOOTSIZE=0x01
# Note that BOOTSIZE is overridden by App SPM menu's default option - this way is just less verbose.
avrdanano.bootloader.avrdudestring=
avrdanano.bootloader.pymcuprogstring=-aerase

#----------------------------------------#
# Exported hex/lst/map names will        #
# indicate selected options. These       #
# are only to do that, nothing else      #
#________________________________________#
avrdanano.build.mcupostfix=
avrdanano.build.printfabr=
avrdanano.build.attachabr=
avrdanano.build.wireabr=
avrdanano.build.flmapabr=.ful
avrdanano.build.appspmabr=.spm{bootloader.CODESIZE}

#^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^#
# AVR-DA submenu options                     #
#____________________________________________#
# Chip (memory and pincount)             #
#________________________________________#
avrdanano.menu.chip.avr128da48=AVR128DA48
avrdanano.menu.chip.avr128da48.build.mcu=avr128da48
avrdanano.menu.chip.avr128da48.upload.maximum_size=131072
avrdanano.menu.chip.avr128da48.upload.maximum_data_size=16384
avrdanano.menu.chip.avr128da48.build.variant=48pin-standard

#----------------------------------------#
# Clock speed and source options         #
#________________________________________#
avrdanano.menu.clock.24internal=24 MHz internal
avrdanano.menu.clock.24internal.build.speed=24
avrdanano.menu.clock.24internal.build.clocksource=0
avrdanano.menu.clock.20internal=20 MHz internal
avrdanano.menu.clock.20internal.build.speed=20
avrdanano.menu.clock.20internal.build.clocksource=0
avrdanano.menu.clock.16internal=16 MHz internal
avrdanano.menu.clock.16internal.build.speed=16
avrdanano.menu.clock.16internal.build.clocksource=0
avrdanano.menu.clock.12internal=12 MHz internal
avrdanano.menu.clock.12internal.build.speed=12
avrdanano.menu.clock.12internal.build.clocksource=0
avrdanano.menu.clock.10internal=10 MHz internal
avrdanano.menu.clock.10internal.build.speed=10
avrdanano.menu.clock.10internal.build.clocksource=0
avrdanano.menu.clock.8internal=8 MHz internal
avrdanano.menu.clock.8internal.build.speed=8
avrdanano.menu.clock.8internal.build.clocksource=0
avrdanano.menu.clock.5internal=5 MHz internal
avrdanano.menu.clock.5internal.build.speed=5
avrdanano.menu.clock.5internal.build.clocksource=0
avrdanano.menu.clock.4internal=4 MHz internal
avrdanano.menu.clock.4internal.build.speed=4
avrdanano.menu.clock.4internal.build.clocksource=0
avrdanano.menu.clock.1internal=1 MHz internal
avrdanano.menu.clock.1internal.build.speed=1
avrdanano.menu.clock.1internal.build.clocksource=0
avrdanano.menu.clock.24extclock=24 MHz ext. clock
avrdanano.menu.clock.24extclock.build.speed=24
avrdanano.menu.clock.24extclock.build.clocksource=2
avrdanano.menu.clock.20extclock=20 MHz ext. clock
avrdanano.menu.clock.20extclock.build.speed=20
avrdanano.menu.clock.20extclock.build.clocksource=2
avrdanano.menu.clock.16extclock=16 MHz ext. clock
avrdanano.menu.clock.16extclock.build.speed=16
avrdanano.menu.clock.16extclock.build.clocksource=2
avrdanano.menu.clock.12extclock=12 MHz ext. clock
avrdanano.menu.clock.12extclock.build.speed=12
avrdanano.menu.clock.12extclock.build.clocksource=2
avrdanano.menu.clock.8extclock=8 MHz ext. clock
avrdanano.menu.clock.8extclock.build.speed=8
avrdanano.menu.clock.8extclock.build.clocksource=2
avrdanano.menu.clock.28internal=28 MHz internal (overclocked)
avrdanano.menu.clock.28internal.build.speed=28
avrdanano.menu.clock.28internal.build.clocksource=0
avrdanano.menu.clock.32internal=32 MHz internal (overclocked)
avrdanano.menu.clock.32internal.build.speed=32
avrdanano.menu.clock.32internal.build.clocksource=0
avrdanano.menu.clock.25extclock=25 MHz ext. clock (slightly overclocked)
avrdanano.menu.clock.25extclock.build.speed=25
avrdanano.menu.clock.25extclock.build.clocksource=2
avrdanano.menu.clock.27extclock=27 MHz ext. clock (overclocked)
avrdanano.menu.clock.27extclock.build.speed=27
avrdanano.menu.clock.27extclock.build.clocksource=2
avrdanano.menu.clock.28extclock=28 MHz ext. clock (overclocked)
avrdanano.menu.clock.28extclock.build.speed=28
avrdanano.menu.clock.28extclock.build.clocksource=2
avrdanano.menu.clock.30extclock=30 MHz ext. clock (overclocked)
avrdanano.menu.clock.30extclock.build.speed=30
avrdanano.menu.clock.30extclock.build.clocksource=2
avrdanano.menu.clock.32extclock=32 MHz ext. clock (overclocked)
avrdanano.menu.clock.32extclock.build.speed=32
avrdanano.menu.clock.32extclock.build.clocksource=2
avrdanano.menu.clock.36extclock=36 MHz ext. clock (highly overclocked)
avrdanano.menu.clock.36extclock.build.speed=36
avrdanano.menu.clock.36extclock.build.clocksource=2
avrdanano.menu.clock.40extclock=40 MHz ext. clock (highly overclocked)
avrdanano.menu.clock.40extclock.build.speed=40
avrdanano.menu.clock.40extclock.build.clocksource=2
avrdanano.menu.clock.48extclock=48 MHz ext. clock (WAY overclocked)
avrdanano.menu.clock.48extclock.build.speed=48
avrdanano.menu.clock.48extclock.build.clocksource=2

