wellmanaz/DxCore/megaavr/boards.txt
#----------------------------------------#
# BrownOut detection (BOD) options       #
#________________________________________#
avrdanano.menu.bodvoltage.1v9=1.9V
avrdanano.menu.bodvoltage.1v9.bootloader.bodlevbits=000
avrdanano.menu.bodvoltage.2v45=2.45V
avrdanano.menu.bodvoltage.2v45.bootloader.bodlevbits=001
avrdanano.menu.bodvoltage.2v70=2.70V
avrdanano.menu.bodvoltage.2v70.bootloader.bodlevbits=010
avrdanano.menu.bodvoltage.2v85=2.85V
avrdanano.menu.bodvoltage.2v85.bootloader.bodlevbits=011
avrdanano.menu.bodmode.disabled=Disabled/Disabled
avrdanano.menu.bodmode.enabled=Enabled/Enabled
avrdanano.menu.bodmode.ensampfast=Enabled/Sampled (128 Hz)
avrdanano.menu.bodmode.ensampslow=Enabled/Sampled (32 Hz)
avrdanano.menu.bodmode.sampledfast=Sampled/Sampled (128 Hz)
avrdanano.menu.bodmode.sampledslow=Sampled/Sampled (32 Hz)
avrdanano.menu.bodmode.sampdisfast=Sampled/Disabled (128 Hz)
avrdanano.menu.bodmode.sampdisslow=Sampled/Disabled (32 Hz)
avrdanano.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
avrdanano.menu.bodmode.disabled.bootloader.BODCFG=0x00
avrdanano.menu.bodmode.enabled.bootloader.bodmodebits=00101
avrdanano.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
avrdanano.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
avrdanano.menu.bodmode.samplefast.bootloader.bodmodebits=01010
avrdanano.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
avrdanano.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
avrdanano.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
avrdanano.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

#----------------------------------------#
# Retain EEPROM (EESAVE)                 #
#________________________________________#
avrdanano.menu.eesave.enable=EEPROM retained
avrdanano.menu.eesave.enable.bootloader.eesavebit=1
avrdanano.menu.eesave.disable=EEPROM not retained
avrdanano.menu.eesave.disable.bootloader.eesavebit=0

#----------------------------------------#
# Reset pin as input option              #
#________________________________________#
avrdanano.menu.resetpin.reset=Hardware Reset (recommended)
avrdanano.menu.resetpin.reset.bootloader.resetpinbits=10
avrdanano.menu.resetpin.input=Input (no output, ever)
avrdanano.menu.resetpin.input.bootloader.resetpinbits=00

#----------------------------------------#
# millis/micros timing source            #
#________________________________________#
avrdanano.menu.millis.tcb2=TCB2 (recommended)
avrdanano.menu.millis.disabled=Disabled
avrdanano.menu.millis.tcb0=TCB0
avrdanano.menu.millis.tcb1=TCB1
avrdanano.menu.millis.tcb3=TCB3 (48/64-pin parts only)
avrdanano.menu.millis.tcb4=TCB4 (64-pin parts only)
avrdanano.menu.millis.tca0=TCA0
avrdanano.menu.millis.tca1=TCA1 (48/64-pin parts only)
avrdanano.menu.millis.tcb0.build.millistimer=B0
avrdanano.menu.millis.tcb1.build.millistimer=B1
avrdanano.menu.millis.tcb2.build.millistimer=B2
avrdanano.menu.millis.tcb3.build.millistimer=B3
avrdanano.menu.millis.tcb4.build.millistimer=B4
avrdanano.menu.millis.tca0.build.millistimer=A0
avrdanano.menu.millis.tca1.build.millistimer=A1
avrdanano.menu.millis.disabled.build.millistimer=NONE

#----------------------------------------#
# printf() version options               #
#________________________________________#
avrdanano.menu.printf.default=Default, 1.5k flash, no floats
avrdanano.menu.printf.full=Full, 2.6k, prints floats
avrdanano.menu.printf.full.build.printf=-Wl,-u,vfprintf -lprintf_flt
avrdanano.menu.printf.full.build.printfabr=.pfF
avrdanano.menu.printf.minimal=Minimal, 1.1k flash used
avrdanano.menu.printf.minimal.build.printf=-Wl,-u,vfprintf -lprintf_min
avrdanano.menu.printf.minimal.build.printfabr=.pfM

#----------------------------------------#
# OPTIMIZATION OPTIONS                   #
#________________________________________#
#avrdanano.menu.optimization.size=-Os (size)
#avrdanano.menu.optimization.sizegcse=-Os (size, no GCSE)
#avrdanano.menu.optimization.o3=-O3 (speed)
#avrdanano.menu.optimization.o3gcse=-O3 (speed, no GCSE)
#avrdanano.menu.optimization.size.build.optimizationlevel=-Os
#avrdanano.menu.optimization.sizegcse.build.optimizationlevel=-Os
#avrdanano.menu.optimization.o3.build.optimizationlevel=-O3
#avrdanano.menu.optimization.o3gcse.build.optimizationlevel=-O3
#avrdanano.menu.optimization.size.build.optabr=.Os
#avrdanano.menu.optimization.sizegcse.build.optabr=.Osng
#avrdanano.menu.optimization.o3.build.optabr=.O3
#avrdanano.menu.optimization.o3gcse.build.optabr=.O3ng
#avrdanano.menu.optimization.sizegcse.build.gcse=-fno-gcse
#avrdanano.menu.optimization.o3gcse.build.gcse=-fno-gcse

#----------------------------------------#
# attachInterrupt Mode                   #
#________________________________________#
avrdanano.menu.attach.allenabled=On all pins, with new implementation.
avrdanano.menu.attach.allenabled.build.attachmode=-DCORE_ATTACH_ALL
avrdanano.menu.attach.manual=Only enabled ports. Please see documentation
avrdanano.menu.attach.manual.build.attachmode=-DCORE_ATTACH_NONE
avrdanano.menu.attach.oldversion=Old version, (may fix bugs)
avrdanano.menu.attach.oldversion.build.attachmode=-DCORE_ATTACH_OLD
avrdanano.menu.attach.manual.build.attachabr=.aMan
avrdanano.menu.attach.oldversion.build.attachabr=.aOld

#----------------------------------------#
# Startup time options                   #
#________________________________________#
avrdanano.menu.startuptime.8=8ms
avrdanano.menu.startuptime.1=0ms
avrdanano.menu.startuptime.1=1ms
avrdanano.menu.startuptime.2=2ms
avrdanano.menu.startuptime.4=4ms
avrdanano.menu.startuptime.16=16ms
avrdanano.menu.startuptime.32=32ms
avrdanano.menu.startuptime.64=64ms
avrdanano.menu.startuptime.0.bootloader.SYSCFG1=0x00
avrdanano.menu.startuptime.1.bootloader.SYSCFG1=0x01
avrdanano.menu.startuptime.2.bootloader.SYSCFG1=0x02
avrdanano.menu.startuptime.4.bootloader.SYSCFG1=0x03
avrdanano.menu.startuptime.8.bootloader.SYSCFG1=0x04
avrdanano.menu.startuptime.16.bootloader.SYSCFG1=0x05
avrdanano.menu.startuptime.32.bootloader.SYSCFG1=0x06
avrdanano.menu.startuptime.64.bootloader.SYSCFG1=0x07

#-------------------------------------#
#         Wire Mode Selection         #
# To enable TWI1 or master+slave mode #
#_____________________________________#
avrdanano.menu.wiremode.mors=1x Wire, Master or Slave (least Flash & RAM)
avrdanano.menu.wiremode.mors.build.wiremode=MORS_SINGLE
avrdanano.menu.wiremode.mors.build.wireabr=.wO
avrdanano.menu.wiremode.mands=1x Wire, Master and Slave
avrdanano.menu.wiremode.mands.build.wiremode=MANDS_SINGLE
avrdanano.menu.wiremode.mands.build.wireabr=.wA
avrdanano.menu.wiremode.mors2=2x Wire, Master or Slave (32+ pin devices only)
avrdanano.menu.wiremode.mors2.build.wiremode=MORS_BOTH
avrdanano.menu.wiremode.mors2.build.wireabr=.wO2
avrdanano.menu.wiremode.mands2=2x Wire, Master and Slave (32+ pin devices only)
avrdanano.menu.wiremode.mands2.build.wiremode=MANDS_BOTH
avrdanano.menu.wiremode.mands2.build.wireabr=.wA2


