wellmanaz/DxCore/megaavr/boards.txt
#----------------------------------------#
# Flash Mapping options                  #
#________________________________________#
avrdanano.menu.flmap.lockdefault=Use last FLMAP section, lock FLMAP, provide PROGMEM_MAPPED
avrdanano.menu.flmap.unlocked=Start w/default, do not lock flmap. No PROGMEM_MAPPED.
avrdanano.menu.flmap.locksection02=Set FLMAP to section 2, lock FLMAP, provide PROGMEM_MAPPED
avrdanano.menu.flmap.locksection1=Set FLMAP to section 1, lock FLMAP, provide PROGMEM_MAPPED
avrdanano.menu.flmap.locksection0=Set FLMAP to section 0, lock FLMAP, provide PROGMEM_MAPPED
avrdanano.menu.flmap.lockdefault.build.flmapopts=-DLOCK_FLMAP -DFLMAPSECTION3
avrdanano.menu.flmap.unlocked.build.flmapopts=
avrdanano.menu.flmap.locksection02.build.flmapopts=-DLOCK_FLMAP -DFLMAPSECTION2
avrdanano.menu.flmap.locksection1.build.flmapopts=-DLOCK_FLMAP -DFLMAPSECTION1
avrdanano.menu.flmap.locksection0.build.flmapopts=-DLOCK_FLMAP -DFLMAPSECTION0
avrdanano.menu.flmap.lockdefault.build.flmapabr=.fld
avrdanano.menu.flmap.unlocked.build.flmapabr=.ful
avrdanano.menu.flmap.locksection02.build.flmapabr=.fl2
avrdanano.menu.flmap.locksection1.build.flmapabr=.fl1
avrdanano.menu.flmap.locksection0.build.flmapabr=.fl0

#----------------------------------------#
# SPM (writing flash from app)           #
#________________________________________#
avrdanano.menu.appspm.no=Disabled (Always use this if not writing flash from app)
avrdanano.menu.appspm.no.bootloader.appspm=
avrdanano.menu.appspm.no.bootloader.BOOTSIZE=0x00
avrdanano.menu.appspm.no.build.appspmabr=
avrdanano.menu.appspm.full=Anywhere after 0x0200 (Warning: App allowed to overwrite itself)
avrdanano.menu.appspm.full.bootloader.appspm=-DSPM_FROM_APP=-1
avrdanano.menu.appspm.full.build.appspmabr=.spmALL
avrdanano.menu.appspm.16plus=Above 16k
avrdanano.menu.appspm.16plus.bootloader.appspm=-DSPM_FROM_APP=32
avrdanano.menu.appspm.16plus.bootloader.CODESIZE=32
avrdanano.menu.appspm.24plus=Above 24k
avrdanano.menu.appspm.24plus.bootloader.appspm=-DSPM_FROM_APP=48
avrdanano.menu.appspm.24plus.bootloader.CODESIZE=48
avrdanano.menu.appspm.32plus=Above 32k (AVR128/64 only)
avrdanano.menu.appspm.32plus.bootloader.appspm=-DSPM_FROM_APP=64
avrdanano.menu.appspm.32plus.bootloader.CODESIZE=64
avrdanano.menu.appspm.48plus=Above 48k (AVR128/64 only)
avrdanano.menu.appspm.48plus.bootloader.appspm=-DSPM_FROM_APP=96
avrdanano.menu.appspm.48plus.bootloader.CODESIZE=96
avrdanano.menu.appspm.56plus=Above 56k (AVR128/64 only)
avrdanano.menu.appspm.56plus.bootloader.appspm=-DSPM_FROM_APP=112
avrdanano.menu.appspm.56plus.bootloader.CODESIZE=112
avrdanano.menu.appspm.60plus=Above 60k (AVR128/64 only)
avrdanano.menu.appspm.60plus.bootloader.appspm=-DSPM_FROM_APP=120
avrdanano.menu.appspm.60plus.bootloader.CODESIZE=120
avrdanano.menu.appspm.64plus=Above 64k (AVR128 only)
avrdanano.menu.appspm.64plus.bootloader.appspm=-DSPM_FROM_APP=128
avrdanano.menu.appspm.64plus.bootloader.CODESIZE=128
avrdanano.menu.appspm.80plus=Above 80k (AVR128 only)
avrdanano.menu.appspm.80plus.bootloader.appspm=-DSPM_FROM_APP=160
avrdanano.menu.appspm.80plus.bootloader.CODESIZE=160
avrdanano.menu.appspm.96plus=Above 96k (AVR128 only)
avrdanano.menu.appspm.96plus.bootloader.appspm=-DSPM_FROM_APP=192
avrdanano.menu.appspm.96plus.bootloader.CODESIZE=192
avrdanano.menu.appspm.112plus=Above 112k (AVR128 only)
avrdanano.menu.appspm.112plus.bootloader.appspm=-DSPM_FROM_APP=224
avrdanano.menu.appspm.112plus.bootloader.CODESIZE=224
avrdanano.menu.appspm.120plus=Above 120k (AVR128 only)
avrdanano.menu.appspm.120plus.bootloader.appspm=-DSPM_FROM_APP=240
avrdanano.menu.appspm.120plus.bootloader.CODESIZE=240

#----------------------------------------#
# WDT MODE                               #
#________________________________________#
avrdanano.menu.WDTtimeout.disabled=Disabled (recommended)
avrdanano.menu.WDTtimeout.8seconds=Window remains open for 8 Seconds
avrdanano.menu.WDTtimeout.4seconds=Window remains open for 4 Seconds
avrdanano.menu.WDTtimeout.2seconds=Window remains open for 2 Seconds
avrdanano.menu.WDTtimeout.1second=Window remains open for 1 Second
avrdanano.menu.WDTtimeout.500msec=Window remains open for 500 milliseconds
avrdanano.menu.WDTtimeout.250msec=Window remains open for 250 milliseconds
avrdanano.menu.WDTtimeout.125msec=Window remains open for 125 milliseconds
avrdanano.menu.WDTtimeout.63msec=Window remains open for 62.5 milliseconds
avrdanano.menu.WDTwindow.disabled=No delay before window "opens"
avrdanano.menu.WDTwindow.8seconds=8 Second before window "opens"
avrdanano.menu.WDTwindow.4seconds=4 Second before window "opens"
avrdanano.menu.WDTwindow.2seconds=2 Second before window "opens"
avrdanano.menu.WDTwindow.1second=1 Second before window "opens"
avrdanano.menu.WDTwindow.500msec=500 millisecond before window "opens"
avrdanano.menu.WDTwindow.250msec=250 millisecond before window "opens"
avrdanano.menu.WDTwindow.125msec=125 millisecond before window "opens"
avrdanano.menu.WDTwindow.63msec=62.5 millisecond before window "opens"
avrdanano.menu.WDTtimeout.disabled.bootloader.wdttimeoutbits=0000
avrdanano.menu.WDTtimeout.8seconds.bootloader.wdttimeoutbits=1011
avrdanano.menu.WDTtimeout.4seconds.bootloader.wdttimeoutbits=1010
avrdanano.menu.WDTtimeout.2seconds.bootloader.wdttimeoutbits=1001
avrdanano.menu.WDTtimeout.1second.bootloader.wdttimeoutbits=1000
avrdanano.menu.WDTtimeout.500msec.bootloader.wdttimeoutbits=0111
avrdanano.menu.WDTtimeout.250msec.bootloader.wdttimeoutbits=0110
avrdanano.menu.WDTtimeout.125msec.bootloader.wdttimeoutbits=0101
avrdanano.menu.WDTtimeout.63msec.bootloader.wdttimeoutbits=0100
avrdanano.menu.WDTwindow.disabled.bootloader.wdtwindowbits=0000
avrdanano.menu.WDTwindow.8seconds.bootloader.wdtwindowbits=1011
avrdanano.menu.WDTwindow.4seconds.bootloader.wdtwindowbits=1010
avrdanano.menu.WDTwindow.2seconds.bootloader.wdtwindowbits=1001
avrdanano.menu.WDTwindow.1second.bootloader.wdtwindowbits=1000
avrdanano.menu.WDTwindow.500msec.bootloader.wdtwindowbits=0111
avrdanano.menu.WDTwindow.250msec.bootloader.wdtwindowbits=0110
avrdanano.menu.WDTwindow.125msec.bootloader.wdtwindowbits=0101
avrdanano.menu.WDTwindow.63msec.bootloader.wdtwindowbits=0100
